# Week 5 Day 1 - Pandas

[Pandas](https://pandas.pydata.org) is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. It is free software released under the three-clause BSD license.

In [1]:
import pandas as pd

In [2]:
# make a dictionary with lists as values
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

In [7]:
#make it a dataframe
mydataset

{'cars': ['BMW', 'Volvo', 'Ford'], 'passings': [3, 7, 2]}

In [9]:
#get the information of your dataframe
mycars = pd.DataFrame(mydataset)
mycars

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [13]:
#get the shape of your dataframe
mycars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   cars      3 non-null      object
 1   passings  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [15]:
#get the shape
mycars.shape

(3, 2)

In [17]:
#get the columns
mycars.columns

Index(['cars', 'passings'], dtype='object')

In [19]:
#get the rows
mycars.values

array([['BMW', 3],
       ['Volvo', 7],
       ['Ford', 2]], dtype=object)

In [21]:
#get the axis
mycars.index.values

array([0, 1, 2])

In [23]:
#get the axis row
mycars.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['cars', 'passings'], dtype='object')]

In [27]:
#get the first row
mycars.loc[0]

cars        BMW
passings      3
Name: 0, dtype: object

In [29]:
mycars.loc[2]

cars        Ford
passings       2
Name: 2, dtype: object

In [31]:
#data type?
type(mycars.loc[2])

pandas.core.series.Series

In [39]:
#use a list of indexs. *since it's range add another hard braket 
mycars.loc[[0,2]]

   cars  passings
0   BMW         3
2  Ford         2

In [41]:
#get a column
mycars['cars']

0      BMW
1    Volvo
2     Ford
Name: cars, dtype: object

In [45]:
#get the rows
mycars.loc[[0,1,2]]

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [47]:
#what are the datatypes of the dataframe
mycars.dtypes

cars        object
passings     int64
dtype: object

In [49]:
#change column 'passings' to float

mycars['passings'].astype('float')

0    3.0
1    7.0
2    2.0
Name: passings, dtype: float64

In [51]:
#look at it again
mycars.dtypes

cars        object
passings     int64
dtype: object

In [61]:
mycars['passings'] = mycars['passings'].astype('float')
mycars

    cars  passings
0    BMW       3.0
1  Volvo       7.0
2   Ford       2.0

In [63]:
#get rid of the last row
mycars.drop(2)

    cars  passings
0    BMW       3.0
1  Volvo       7.0

In [65]:
#if you look at it again it didn't actually disappear
mycars

    cars  passings
0    BMW       3.0
1  Volvo       7.0
2   Ford       2.0

In [67]:
#to actually get rid of the cloumn make a new dataframe
newDf = mycars.drop(2)
newDf

    cars  passings
0    BMW       3.0
1  Volvo       7.0

In [74]:
#get rid of the passings column
newDf = newDf.drop('passings', axis = 'columns')
newDf

    cars
0    BMW
1  Volvo

<!--  -->

### NaN & empty data

In [85]:
import numpy as np

uglyData = {
  'cars': ["BMW", 'Jeep', "Ford", 'Chrysler'],
  'passings': [3, np.nan, 2, 'NaN']
}

uglyDF = pd.DataFrame(uglyData)

In [87]:
uglyDF

       cars passings
0       BMW        3
1      Jeep      NaN
2      Ford        2
3  Chrysler      NaN

In [93]:
#drop the Nan, this can drop the null-values
uglyDF_clean =uglyDF.dropna()

In [99]:
uglyDF_clean

       cars passings
0       BMW        3
2      Ford        2
3  Chrysler      NaN

In [107]:
#replace NaN it with 0
uglyDF_clean2 = uglyDF.fillna(0)
uglyDF_clean2

       cars passings
0       BMW        3
1      Jeep        0
2      Ford        2
3  Chrysler      NaN

<!--  -->

### .csv Files

**pd.read_csv** 

A simple way to store big data sets is to use CSV files (comma separated files).
CSV files contains plain text and is a well know format that can be read by everyone including Pandas.

*pd.read_csv(filepath_or_buffer, sep=’ ,’ , header=’infer’,  index_col=None, usecols=None, engine=None, skiprows=None, nrows=None)*

In [115]:
#import tv_shows.csv
df = pd.read_csv('Data_txtFiles/tv_shows.csv')

In [117]:
df

,Unnamed: 0,title,year,runtime,rating,votes,genre,text
0,0,Game of Thrones,(2011 TV Series),55 mins.,9.5,"748,557","[u'Adventure', u'Drama', u'Fantasy']",Several noble families fight for control of th...
1,1,Breaking Bad,(2008 TV Series),45 mins.,9.5,"662,459","[u'Crime', u'Drama', u'Thriller']",A chemistry teacher diagnosed with a terminal ...
2,2,The Walking Dead,(2010 TV Series),44 mins.,8.7,"500,301","[u'Drama', u'Horror']",Sheriff's Deputy Rick Grimes leads a group of ...
3,3,The Big Bang Theory,(2007 TV Series),22 mins.,8.5,"438,226",[u'Comedy'],A woman who moves into an apartment across the...
4,4,Dexter,(2006 TV Series),55 mins.,8.9,"419,031","[u'Crime', u'Drama', u'Mystery', u'Thriller']",A Miami police forensics expert moonlights as ...
...,...,...,...,...,...,...,...,...
1969,1969,Cristela,(2014 TV Series),30 mins.,6.3,"1,510",[u'Comedy'],"In her sixth year of law school, Cristela is f..."
1970,1970,Power Rangers in Space,(1998 TV Series),30 mins.,7.2,"1,504","[u'Action', u'Adventure', u'Family', u'Sci-Fi']",The most evil forces of the universe (Rita &am...
1971,1971,Reading Rainbow,(1983 TV Series),30 mins.,8.5,"1,501",[u'Family'],Levar Burton introduces young viewers to illus...
1972,1972,Martial Law,(1998 TV Series),45 mins.,7.1,"1,501","[u'Comedy', u'Crime', u'Action']",A Shanghai cop who is a master of martial arts...
1973,1973,Beast Machines: Transformers,(1999 TV Series),30 mins.,6.9,"1,500","[u'Action', u'Animation', u'Sci-Fi']",The Maximals awaken on their home planet of Cy...

In [123]:
#get a preview
df.head()

,Unnamed: 0,title,year,runtime,rating,votes,genre,text
0,0,Game of Thrones,(2011 TV Series),55 mins.,9.5,"748,557","[u'Adventure', u'Drama', u'Fantasy']",Several noble families fight for control of th...
1,1,Breaking Bad,(2008 TV Series),45 mins.,9.5,"662,459","[u'Crime', u'Drama', u'Thriller']",A chemistry teacher diagnosed with a terminal ...
2,2,The Walking Dead,(2010 TV Series),44 mins.,8.7,"500,301","[u'Drama', u'Horror']",Sheriff's Deputy Rick Grimes leads a group of ...
3,3,The Big Bang Theory,(2007 TV Series),22 mins.,8.5,"438,226",[u'Comedy'],A woman who moves into an apartment across the...
4,4,Dexter,(2006 TV Series),55 mins.,8.9,"419,031","[u'Crime', u'Drama', u'Mystery', u'Thriller']",A Miami police forensics expert moonlights as ...

In [125]:
#what columns of the csv file
df.columns

Index(['Unnamed: 0', 'title', 'year', 'runtime', 'rating', 'votes', 'genre',
       'text'],
      dtype='object')

In [127]:
# Return the number of not empty cells for each column/row
df.count()

Unnamed: 0    1974
title         1974
year          1974
runtime       1814
rating        1974
votes         1974
genre         1970
text          1941
dtype: int64

In [129]:
#clean the data
df2 = df.dropna()
df.count()

Unnamed: 0    1974
title         1974
year          1974
runtime       1814
rating        1974
votes         1974
genre         1970
text          1941
dtype: int64

In [133]:
#only import the columns ["title", "year", "rating", "votes"]
df3 = pd.read_csv('Data_txtFiles/tv_shows.csv', usecols = ['title', 'year', 'rating', 'votes'])
df3.head()

                 title              year  rating    votes
0      Game of Thrones  (2011 TV Series)     9.5  748,557
1         Breaking Bad  (2008 TV Series)     9.5  662,459
2     The Walking Dead  (2010 TV Series)     8.7  500,301
3  The Big Bang Theory  (2007 TV Series)     8.5  438,226
4               Dexter  (2006 TV Series)     8.9  419,031

In [135]:
df3.count()

title     1974
year      1974
rating    1974
votes     1974
dtype: int64

In [137]:
#what is the maximum rating? 
df3['rating'].max()

9.6

In [139]:
#what is the minimum rating?
df3['rating'].min()

1.8

In [143]:
#find the avg of all of the ratings
avgNum = df3['rating'].mean()
avgNum

7.486524822695036

In [147]:
df3.head()

                 title              year  rating    votes
0      Game of Thrones  (2011 TV Series)     9.5  748,557
1         Breaking Bad  (2008 TV Series)     9.5  662,459
2     The Walking Dead  (2010 TV Series)     8.7  500,301
3  The Big Bang Theory  (2007 TV Series)     8.5  438,226
4               Dexter  (2006 TV Series)     8.9  419,031

In [151]:
#what data types are in the dataframe? 
df3.dtypes

title      object
year       object
rating    float64
votes      object
dtype: object

In [161]:
#set the index to be the names of the tv show. (hint: Make index the title)
df4 = df3.set_index('title')
df4.head()

                                 year  rating    votes
title
Game of Thrones      (2011 TV Series)     9.5  748,557
Breaking Bad         (2008 TV Series)     9.5  662,459
The Walking Dead     (2010 TV Series)     8.7  500,301
The Big Bang Theory  (2007 TV Series)     8.5  438,226
Dexter               (2006 TV Series)     8.9  419,031

In [163]:
#get the year of hte new dataframe
df4['year']

title
Game of Thrones                 (2011 TV Series)
Breaking Bad                    (2008 TV Series)
The Walking Dead                (2010 TV Series)
The Big Bang Theory             (2007 TV Series)
Dexter                          (2006 TV Series)
                                      ...
Cristela                        (2014 TV Series)
Power Rangers in Space          (1998 TV Series)
Reading Rainbow                 (1983 TV Series)
Martial Law                     (1998 TV Series)
Beast Machines: Transformers    (1999 TV Series)
Name: year, Length: 1974, dtype: object

<!--  -->

### .json files

**pd.read_json**

JSON = Python Dictionary

JSON objects have the same format as Python dictionaries. If your JSON code is not in a file, but in a Python Dictionary, you can load it into a DataFrame directly.

In [165]:
dataJson = {
    'item1':{
        "0":60,
        "1":60,
        "2":60
    },
    'item2':{
        '0':100,
        '1':100,
        '2':100
    }
}

In [168]:
dfjson = pd.DataFrame(dataJson)

In [172]:
#read in nationalParks.json
df = pd.read_json('Data_txtFiles/nationalparks.json')
df.head()

,area,coordinates,date_established_readable,date_established_unix,description,image,nps_link,states,title,id,visitors,world_heritage_site
0,"{'acres': '49,057.36', 'square_km': '198.5'}","{'latitude': 44.35, 'longitude': -68.21}","February 26, 1919",-1604599200,Covering most of Mount Desert Island and other...,"{'url': 'acadia.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/acad/index.htm,"[{'id': 'state_maine', 'title': 'Maine'}]",Acadia,park_acadia,"3,303,393",False
1,"{'acres': '8,256.67', 'square_km': '33.4'}","{'latitude': -14.25, 'longitude': -170.68}","October 31, 1988",594280800,The southernmost National Park is on three Sam...,"{'url': 'american-samoa.jpg', 'attribution': '...",https://www.nps.gov/npsa/index.htm,"[{'id': 'state_american-samoa', 'title': 'Amer...",American Samoa,park_american-samoa,"28,892",False
2,"{'acres': '76,678.98', 'square_km': '310.3'}","{'latitude': 38.68, 'longitude': -109.57}","November 12, 1971",58773600,"This site features more than 2,000 natural san...","{'url': 'arches.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/arch/index.htm,"[{'id': 'state_utah', 'title': 'Utah'}]",Arches,park_arches,"1,585,718",False
3,"{'acres': '242,755.94', 'square_km': '982.4'}","{'latitude': 43.75, 'longitude': -102.5}","November 10, 1978",279525600,"The Badlands are a collection of buttes, pinna...","{'url': 'badlands.jpg', 'attribution': 'PixelB...",https://www.nps.gov/badl/index.htm,"[{'id': 'state_south-dakota', 'title': 'South ...",Badlands,park_badlands,"996,263",False
4,"{'acres': '801,163.21', 'square_km': '3,242.2'}","{'latitude': 29.25, 'longitude': -103.25}","June 12, 1944",-806439600,Named for the prominent bend in the Rio Grande...,"{'url': 'big-bend.jpg', 'attribution': 'PixelB...",https://www.nps.gov/bibe/index.htm,"[{'id': 'state_texas', 'title': 'Texas'}]",Big Bend,park_big-bend,"388,290",False

In [219]:
df.dtypes

area                         object
coordinates                  object
date_established_readable    object
date_established_unix         int64
description                  object
image                        object
nps_link                     object
states                       object
title                        object
id                           object
visitors                     object
world_heritage_site            bool
dtype: object

In [221]:
#only get the ['date_established_readable','description', 'title', 'visitors', 'world_heritage_site', 'states ]
df2 = df[['title','visitors','date_established_readable','description', 'world_heritage_site', 'states']]
df2.head()

,title,visitors,date_established_readable,description,world_heritage_site,states
0,Acadia,"3,303,393","February 26, 1919",Covering most of Mount Desert Island and other...,False,"[{'id': 'state_maine', 'title': 'Maine'}]"
1,American Samoa,"28,892","October 31, 1988",The southernmost National Park is on three Sam...,False,"[{'id': 'state_american-samoa', 'title': 'Amer..."
2,Arches,"1,585,718","November 12, 1971","This site features more than 2,000 natural san...",False,"[{'id': 'state_utah', 'title': 'Utah'}]"
3,Badlands,"996,263","November 10, 1978","The Badlands are a collection of buttes, pinna...",False,"[{'id': 'state_south-dakota', 'title': 'South ..."
4,Big Bend,"388,290","June 12, 1944",Named for the prominent bend in the Rio Grande...,False,"[{'id': 'state_texas', 'title': 'Texas'}]"

In [223]:
#get the datatypes
df2.dtypes

title                        object
visitors                     object
date_established_readable    object
description                  object
world_heritage_site            bool
states                       object
dtype: object

In [225]:
#find the national parks that are world heritage sites
whsNum = df2[df2['world_heritage_site'] == True]
len(whsNum)

14

<!--  -->

#### Exercise 1: get the national parks with over a million visitors

In [229]:
df2.head()

,title,visitors,date_established_readable,description,world_heritage_site,states
0,Acadia,"3,303,393","February 26, 1919",Covering most of Mount Desert Island and other...,False,"[{'id': 'state_maine', 'title': 'Maine'}]"
1,American Samoa,"28,892","October 31, 1988",The southernmost National Park is on three Sam...,False,"[{'id': 'state_american-samoa', 'title': 'Amer..."
2,Arches,"1,585,718","November 12, 1971","This site features more than 2,000 natural san...",False,"[{'id': 'state_utah', 'title': 'Utah'}]"
3,Badlands,"996,263","November 10, 1978","The Badlands are a collection of buttes, pinna...",False,"[{'id': 'state_south-dakota', 'title': 'South ..."
4,Big Bend,"388,290","June 12, 1944",Named for the prominent bend in the Rio Grande...,False,"[{'id': 'state_texas', 'title': 'Texas'}]"

In [271]:
df2_cleanVis = df2

#get just the column with visitors
df2_cleanVis['visitors'] = df2_cleanVis['visitors'].replace(',','', regex = True)
df2_cleanVis.head()

/var/folders/x3/ktb8zmvs52zd_gw6_7z20blw0000gn/T/ipykernel_58631/786656043.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2_cleanVis['visitors'] = df2_cleanVis['visitors'].replace(',','', regex = True)

,title,visitors,date_established_readable,description,world_heritage_site,states
0,Acadia,3303393,"February 26, 1919",Covering most of Mount Desert Island and other...,False,"[{'id': 'state_maine', 'title': 'Maine'}]"
1,American Samoa,28892,"October 31, 1988",The southernmost National Park is on three Sam...,False,"[{'id': 'state_american-samoa', 'title': 'Amer..."
2,Arches,1585718,"November 12, 1971","This site features more than 2,000 natural san...",False,"[{'id': 'state_utah', 'title': 'Utah'}]"
3,Badlands,996263,"November 10, 1978","The Badlands are a collection of buttes, pinna...",False,"[{'id': 'state_south-dakota', 'title': 'South ..."
4,Big Bend,388290,"June 12, 1944",Named for the prominent bend in the Rio Grande...,False,"[{'id': 'state_texas', 'title': 'Texas'}]"

<!--  -->

In [274]:
df2_cleanVis.dtypes

title                        object
visitors                     object
date_established_readable    object
description                  object
world_heritage_site            bool
states                       object
dtype: object

In [276]:
#change the data type
df2_cleanVis['visitors'] = df2_cleanVis['visitors'].astype('int')

/var/folders/x3/ktb8zmvs52zd_gw6_7z20blw0000gn/T/ipykernel_58631/1949495153.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2_cleanVis['visitors'] = df2_cleanVis['visitors'].astype('int')

In [278]:
df2_cleanVis.dtypes

title                        object
visitors                      int64
date_established_readable    object
description                  object
world_heritage_site            bool
states                       object
dtype: object

In [282]:
milVis = df2_cleanVis[df2_cleanVis['visitors'] > 1000000]
milVis

,title,visitors,date_established_readable,description,world_heritage_site,states
0,Acadia,3303393,"February 26, 1919",Covering most of Mount Desert Island and other...,False,"[{'id': 'state_maine', 'title': 'Maine'}]"
2,Arches,1585718,"November 12, 1971","This site features more than 2,000 natural san...",False,"[{'id': 'state_utah', 'title': 'Utah'}]"
7,Bryce Canyon,2365110,"February 25, 1928",Bryce Canyon is a geological amphitheater on t...,False,"[{'id': 'state_utah', 'title': 'Utah'}]"
9,Capitol Reef,1064904,"December 18, 1971",The park's Waterpocket Fold is a 100-mile (160...,False,"[{'id': 'state_utah', 'title': 'Utah'}]"
14,Cuyahoga Valley,2423390,"October 11, 2000",This park along the Cuyahoga River has waterfa...,False,"[{'id': 'state_ohio', 'title': 'Ohio'}]"
15,Death Valley,1296283,"October 31, 1994","Death Valley is the hottest, lowest, and dries...",False,"[{'id': 'state_california', 'title': 'Californ..."
20,Glacier,2946681,"May 11, 1910",The U.S. half of Waterton-Glacier Internationa...,True,"[{'id': 'state_montana', 'title': 'Montana'}]"
22,Grand Canyon,5969811,"February 26, 1919","The Grand Canyon, carved by the mighty Colorad...",True,"[{'id': 'state_arizona', 'title': 'Arizona'}]"
23,Grand Teton,3270076,"February 26, 1929",Grand Teton is the tallest mountain in the Tet...,False,"[{'id': 'state_wyoming', 'title': 'Wyoming'}]"
26,Great Smoky Mountains,11312786,"June 15, 1934","The Great Smoky Mountains, part of the Appalac...",True,"[{'id': 'state_tennessee', 'title': 'Tennessee..."
28,Haleakala,1263558,"August 1, 1916",The Haleakala volcano on Maui features a very ...,False,"[{'id': 'state_hawaii', 'title': 'Hawaii'}]"
29,Hawaii Volcanoes,1887580,"August 1, 1916",This park on the Big Island protects the Kīlau...,True,"[{'id': 'state_hawaii', 'title': 'Hawaii'}]"
30,Hot Springs,1544300,"March 4, 1921",Hot Springs was established by act of Congress...,False,"[{'id': 'state_arkansas', 'title': 'Arkansas'}]"
32,Joshua Tree,2505286,"October 31, 1994",Covering large areas of the Colorado and Mojav...,False,"[{'id': 'state_california', 'title': 'Californ..."
41,Mount Rainier,1356913,"March 2, 1899","Mount Rainier, an active stratovolcano, is the...",False,"[{'id': 'state_washington', 'title': 'Washingt..."
43,Olympic,3390221,"June 29, 1938","Situated on the Olympic Peninsula, this park i...",True,"[{'id': 'state_washington', 'title': 'Washingt..."
47,Rocky Mountain,4517585,"January 26, 1915",Bisected north to south by the Continental Div...,False,"[{'id': 'state_colorado', 'title': 'Colorado'}]"
49,Sequoia,1254688,"September 25, 1890","This park protects the Giant Forest, which boa...",False,"[{'id': 'state_california', 'title': 'Californ..."
50,Shenandoah,1437341,"December 26, 1935",Shenandoah's Blue Ridge Mountains are covered ...,False,"[{'id': 'state_virginia', 'title': 'Virginia'}]"
56,Yellowstone,4257177,"March 1, 1872","Situated on the Yellowstone Caldera, the park ...",True,"[{'id': 'state_wyoming', 'title': 'Wyoming'}, ..."
57,Yosemite,5028868,"October 1, 1890","Yosemite features sheer granite cliffs, except...",True,"[{'id': 'state_california', 'title': 'Californ..."
58,Zion,4295127,"November 19, 1919",Located at the junction of the Colorado Platea...,False,"[{'id': 'state_utah', 'title': 'Utah'}]"

### Exercise 2: Create a dictionary of the number of national parks per state

In [285]:
df2['states'][0]

[{'id': 'state_maine', 'title': 'Maine'}]

In [287]:
type(df2['states'][0])

list

In [289]:
type(df2['states'][0][0])

dict

In [291]:
df2['states'][0][0]['title']

'Maine'

In [293]:
#this EXPLODES the data. This also removes the list
df2_big = df2.explode('states')
df2_big.head()

,title,visitors,date_established_readable,description,world_heritage_site,states
0,Acadia,3303393,"February 26, 1919",Covering most of Mount Desert Island and other...,False,"{'id': 'state_maine', 'title': 'Maine'}"
1,American Samoa,28892,"October 31, 1988",The southernmost National Park is on three Sam...,False,"{'id': 'state_american-samoa', 'title': 'Ameri..."
2,Arches,1585718,"November 12, 1971","This site features more than 2,000 natural san...",False,"{'id': 'state_utah', 'title': 'Utah'}"
3,Badlands,996263,"November 10, 1978","The Badlands are a collection of buttes, pinna...",False,"{'id': 'state_south-dakota', 'title': 'South D..."
4,Big Bend,388290,"June 12, 1944",Named for the prominent bend in the Rio Grande...,False,"{'id': 'state_texas', 'title': 'Texas'}"

In [295]:
df2_big['states'][0]['title']

'Maine'

In [297]:
#this is another way of DUPLICATING data
df2_big['states_id'] = df2_big['states']
df2_big.head()

,title,visitors,date_established_readable,description,world_heritage_site,states,states_id
0,Acadia,3303393,"February 26, 1919",Covering most of Mount Desert Island and other...,False,"{'id': 'state_maine', 'title': 'Maine'}","{'id': 'state_maine', 'title': 'Maine'}"
1,American Samoa,28892,"October 31, 1988",The southernmost National Park is on three Sam...,False,"{'id': 'state_american-samoa', 'title': 'Ameri...","{'id': 'state_american-samoa', 'title': 'Ameri..."
2,Arches,1585718,"November 12, 1971","This site features more than 2,000 natural san...",False,"{'id': 'state_utah', 'title': 'Utah'}","{'id': 'state_utah', 'title': 'Utah'}"
3,Badlands,996263,"November 10, 1978","The Badlands are a collection of buttes, pinna...",False,"{'id': 'state_south-dakota', 'title': 'South D...","{'id': 'state_south-dakota', 'title': 'South D..."
4,Big Bend,388290,"June 12, 1944",Named for the prominent bend in the Rio Grande...,False,"{'id': 'state_texas', 'title': 'Texas'}","{'id': 'state_texas', 'title': 'Texas'}"

In [299]:
#initialize the dict first
stateParks = {}

# get the data in each of the state column

for i in df2_big['states']:
    # get the names of the state
    stateName = i['title']
    # add the number of each instance to a dictionary
    if stateName in stateParks.keys():
        stateParks[stateName] += 1

    else:
        stateParks[stateName] = 1

In [301]:
stateParks

{'Maine': 1,
 'American Samoa': 1,
 'Utah': 5,
 'South Dakota': 2,
 'Texas': 2,
 'Florida': 3,
 'Colorado': 4,
 'New Mexico': 1,
 'California': 9,
 'South Carolina': 1,
 'Oregon': 1,
 'Ohio': 1,
 'Nevada': 2,
 'Alaska': 8,
 'Montana': 2,
 'Arizona': 3,
 'Wyoming': 2,
 'Tennessee': 1,
 'North Carolina': 1,
 'Hawaii': 2,
 'Arkansas': 1,
 'Michigan': 1,
 'Kentucky': 1,
 'Washington': 3,
 'Virginia': 1,
 'North Dakota': 1,
 'US Virgin Islands': 1,
 'Minnesota': 1,
 'Idaho': 1}